ZigEmbeddedGroup/texasinstruments-data/ccs_base/common/targetdb/Modules/msp/mspm33c321x/I2S0_1.0.xml
Note: 
  In ULP domain the trigger levels are used for:
  0: LVL_1_4
  4: LVL_FULL
  For undefined settings the default configuration is used." begin="6" end="4" width="3" rwaccess="R/W">
            <bitenum id="LVL_1_4" value="0x1" description="RX FIFO &gt;= 1/4 full"/>
            <bitenum id="LVL_1_2" value="0x2" description="RX FIFO &gt;= 1/2 full (default)"/>
            <bitenum id="LVL_3_4" value="0x3" description="RX FIFO &gt;= 3/4 full"/>
            <bitenum id="LVL_FULL" value="0x5" description="RX FIFO is full"/>
            <bitenum id="LVL_ALMOST_FULL" value="0x6" description="RX_FIFO &gt;= (MAX_FIFO_LEN -1)"/>
            <bitenum id="LVL_ALMOST_EMPTY" value="0x7" description="RX_FIFO &lt;= 1"/>
        </bitfield>
        <bitfield id="TXCLR" description="TX FIFO CLEAR. Setting this bit will clear the TX FIFO contents." begin="3" end="3" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
        <bitfield id="RXCLR" description="RX FIFO CLEAR. Setting this bit will clear the RX FIFO contents." begin="7" end="7" width="1" rwaccess="R/W">
            <bitenum id="DISABLE" value="0x0" description="Disable FIFO clear"/>
            <bitenum id="ENABLE" value="0x1" description="Enable FIFO Clear"/>
        </bitfield>
    </register>
    <register id="I2S0_WCLKSRC" width="32" offset="0x1110" description="This register configures the **WCLK** Source">
        <bitfield id="WBCLKSRC" description="This field selects **WCLK**/**BCLK** source for **I2S**." begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="NONE" value="0x0" description="None ('0')"/>
            <bitenum id="EXT" value="0x1" description="External **WCLK** generator, from pad"/>
            <bitenum id="INT" value="0x2" description="Internal **WCLK** generator, from module PRCM"/>
            <bitenum id="RESERVED" value="0x3" description="Not supported. Will give same **WCLK** as 'NONE' ('00')"/>
        </bitfield>
        <bitfield id="WCLKINV" description="This field Inverts **WCLK** source (pad or internal)." begin="2" end="2" width="1" rwaccess="R/W">
            <bitenum id="NOT_INTVERTED" value="0x0" description="Source is not intverted"/>
            <bitenum id="INVERTED" value="0x1" description="Source is inverted"/>
        </bitfield>
    </register>
    <register id="I2S0_DIRCFG" width="32" offset="0x1118" description="This register configures the direction of data pins(**AD0**/**AD1**)">
        <bitfield id="AD0" description="The field configures the **AD0** data pin direction" begin="1" end="0" width="2" rwaccess="R/W">
            <bitenum id="DIS" value="0x0" description="Not in use (disabled)"/>
            <bitenum id="IN" value="0x1" description="Input"/>
            <bitenum id="OUT" value="0x2" description="Output"/>
            <bitenum id="RESERVED" value="0x3" description="Reserved"/>
        </bitfield>
        <bitfield id="AD1" description="The field configures the **AD1** data pin direction" begin="5" end="4" width="2" rwaccess="R/W">
            <bitenum id="DIS" value="0x0" description="Not in use (disabled)"/>
            <bitenum id="IN" value="0x1" description="Input"/>
            <bitenum id="OUT" value="0x2" description="Output"/>
            <bitenum id="RESERVED" value="0x3" description="Reserved"/>
        </bitfield>
    </register>
    <register id="I2S0_TXDATA" width="32" offset="0x1120" description="UART Transmit Data Register">
        <bitfield id="DATA" description="Data Transmitted or Received  Data that is to be transmitted via the UART is written to this field.  When read, this field contains the data that was received by the UART." begin="31" end="0" width="32" rwaccess="R/W">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="I2S0_RXDATA" width="32" offset="0x1124" description="UART Receive Data Register">
        <bitfield id="DATA" description="Received Data.  When read, this field contains the data that was received by the UART." begin="31" end="0" width="32" rwaccess="R">
            <bitenum id="MINIMUM" value="0x0" description="Smallest value"/>
            <bitenum id="MAXIMUM" value="0xFFFFFFFF" description="Highest possible value"/>
        </bitfield>
    </register>
    <register id="I2S0_WMASK0" width="32" offset="0x1148" description="This register configures the word selection dit mask for data pin 0(**AD0**)">
        <bitfield id="MASK" description="Bit-mask indicating valid channels in a frame on AD0.

In single-phase mode, each bit represents one channel, starting with **LSB** for the first word in the frame. A frame can contain up to 8/16 channels based on SoC configuration.  Channels that are not included in the mask will not be sampled nor stored in memory; data clocked out in these slots is as per configured EMPTYSLOTOUTPUT.

In dual-phase mode, only the two **LSB**s are considered. For a stereo configuration, set both bits. For a mono configuration, set bit 0 only. In mono mode, only channel 0 will be sampled and stored to memory, and channel 0 will be repeated when clocked out.

In mono mode, only channel 0 will be sampled and stored to memory, and channel 0 will be repeated in the second phase when clocked out.

If all bits are zero, no input words will be stored to memory, and the output data lines will be constant '0'. This can be utilized when **PWM** debug output is desired without any actively used output pins." begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="I2S0_WMASK1" width="32" offset="0x114C" description="This register configures the word selection dit mask for data pin 1(**AD1**)">
        <bitfield id="MASK" description="Bit-mask indicating valid channels in a frame on AD1.

In single-phase mode, each bit represents one channel, starting with **LSB** for the first word in the frame. A frame can contain up to 8/16 channels based on SoC configuration.  Channels that are not included in the mask will not be sampled nor stored in memory; data clocked out in these slots is as per configured EMPTYSLOTOUTPUT.

In dual-phase mode, only the two **LSB**s are considered. For a stereo configuration, set both bits. For a mono configuration, set bit 0 only. In mono mode, only channel 0 will be sampled and stored to memory, and channel 0 will be repeated when clocked out.

In mono mode, only channel 0 will be sampled and stored to memory, and channel 0 will be repeated in the second phase when clocked out.

If all bits are zero, no input words will be stored to memory, and the output data lines will be constant '0'. This can be utilized when **PWM** debug output is desired without any actively used output pins." begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="I2S0_MCLKDIV" width="32" offset="0x1160" description="This field configures **MCLK** division ratio">
        <bitfield id="MDIV" description="An unsigned factor of the division ratio used to generate **MCLK** [2-1024]:
                                            **MCLK** = MCUCLK/MDIV[Hz] **MCUCLK** is upto 96MHz. 
                                            A value of 0 is interpreted as 1024.
                                            A value of 1 is invalid. 
                                            If MDIV is odd the low phase of the clock is one **MCUCLK** period longer than the high phase." begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="I2S0_WCLKDIV" width="32" offset="0x1164" description="Configures WCLK division ratio">
        <bitfield id="WDIV" description="If[CLKCTL.WCLKPHASE]= 0, Single phase. **WCLK**is high one**BCLK**period and low WDIV[9:0] (unsigned, [1-1023])**BCLK**periods. 
                                           **WCLK**=**MCUCLK**/ BDIV*(WDIV[9:0] + 1) [Hz] **MCUCLK**upto 96MHz. 
                                           If[CLKCTL.WCLKPHASE.*]= 1, Dual phase. Each phase on**WCLK**(50% duty cycle) is WDIV[9:0] (unsigned, [1-1023])**BCLK**periods. 
                                           **WCLK**=**MCUCLK**/ BDIV*(2*WDIV[9:0]) [Hz] 
                                           If[CLKCTL.WCLKPHASE.*] = 2, User defined. **WCLK**is high WDIV[7:0] (unsigned, [1-255])**BCLK**periods and low WDIV[15:8] (unsigned, [1-255])**BCLK**periods.
                                           **WCLK**=**MCUCLK**/ (BDIV*(WDIV[7:0] + WDIV[15:8]) [Hz]" begin="15" end="0" width="16" rwaccess="R/W">
        </bitfield>
    </register>
    <register id="I2S0_BCLKDIV" width="32" offset="0x1168" description="This field configures **BCLK** division ratio">
        <bitfield id="BDIV" description="An unsigned factor of the division ratio used to generate **BCLK** [2-1024]:
                                            **BCLK** = MCUCLK/BDIV[Hz] 
                                            A value of 0 is interpreted as 1024.
                                            A value of 1 is invalid. 
                                            If BDIV is odd and [FMTCFG.SMPLEDGE] = 0, the low phase of the clock is one **MCUCLK** period longer than the high phase. 
                                            If BDIV is odd and [FMTCFG.SMPLEDGE] = 1 , the high phase of the clock is one **MCUCLK** period longer than the low phase." begin="9" end="0" width="10" rwaccess="R/W">
        </bitfield>
    </register>

</module>